


define(function (require) {

    var ret = {};

    String.prototype.repeat = function (n) {
        var _this = this;
        var result = '';
        for (var i = 0; i < n; i++) {
            result += _this;
        }
        return result;
    }

    ret.getGrid1Data = function () {
    	var arr = [];
    	var unit = {};
    	var prop = ['Id'];
    	var data = [
['1', '锅炉', '#1机组', '高压电机SIS点检', '1#空预器', '1#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['2', '锅炉', '#1机组', '高压电机SIS点检', '2#空预器', '2#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['3', '锅炉', '#1机组', '高压电机SIS点检', '3#空预器', '3#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '50', '自动', '2016.06.13 15:00'],
['4', '锅炉', '#1机组', '高压电机SIS点检', '4#空预器', '4#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['5', '锅炉', '#1机组', '高压电机SIS点检', '5#空预器', '5#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '60', '自动', '2016.06.13 15:00'],
['6', '锅炉', '#1机组', '高压电机SIS点检', '6#空预器', '6#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['7', '锅炉', '#1机组', '高压电机SIS点检', '7#空预器', '7#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '75', '自动', '2016.06.13 15:00'],
['8', '锅炉', '#1机组', '高压电机SIS点检', '8#空预器', '8#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['9', '锅炉', '#1机组', '高压电机SIS点检', '9#空预器', '9#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '40', '自动', '2016.06.13 15:00'],
['10', '锅炉', '#1机组', '高压电机SIS点检', '10#空预器', '10#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['11', '锅炉', '#1机组', '高压电机SIS点检', '11#空预器', '11#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '30', '自动', '2016.06.13 15:00'],
['12', '锅炉', '#1机组', '高压电机SIS点检', '12#空预器', '12#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['13', '锅炉', '#1机组', '高压电机SIS点检', '13#空预器', '13#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '60', '自动', '2016.06.13 15:00'],
['14', '锅炉', '#1机组', '高压电机SIS点检', '14#空预器', '14#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '50', '自动', '2016.06.13 15:00'],
['15', '锅炉', '#1机组', '高压电机SIS点检', '15#空预器', '15#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['16', '锅炉', '#1机组', '高压电机SIS点检', '16#空预器', '16#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '70', '自动', '2016.06.13 15:00'],
['17', '锅炉', '#1机组', '高压电机SIS点检', '17#空预器', '17#空预器主电机温度', '2016-9-22', '自动点检', 'op', '登记', '80', '30', '71', '自动', '2016.06.13 15:00'],
    	];

    	for (var i = 0; i < data[0].length; i++) {
    		prop.push(String.fromCharCode(0x60 + i + 1).repeat(4));
       	}
       	for (var i = 0; i < data.length; i++) {
       		unit[prop[0]] = i+1;
       		for (var j = 1; j < prop.length; j++) {
       			unit[prop[j]] = data[i][j-1];
       		}
       		arr.push(JSON.parse(JSON.stringify(unit)));
       	}
        return arr;
    }

    return ret;

})



















