


define(function (require) {

    var ret = {};

    String.prototype.repeat = function (n) {
        var _this = this;
        var result = '';
        for (var i = 0; i < n; i++) {
            result += _this;
        }
        return result;
    }

    ret.getGrid1Data = function () {
    	var arr = [];
    	var unit = {};
    	var prop = ['Id'];
    	var data = [
['动力车间', '1、2号机380V段', '1#给煤控制中心', '变压器保护', 'WBZ196-2', '奥祥电力自动化', '2015/12/3', '',''],
['动力车间', '1、2号机380V段', '1#射水泵（7号）', '变压器保护', 'WBZ196-3', '奥祥电力自动化', '2015/12/3', '',''],
['动力车间', '1、2号机380V段', '1号工业水泵（8号）', '电动机保护', 'WBZ196-1', '奥祥电力自动化', '2015/12/3', '',''],
['动力车间', '1、2号机380V段', '热水循环泵', '电动机保护', 'WBZ196-2', '奥祥电力自动化', '2015/12/3', '',''],
['动力车间', '1、2号机380V段', '1#氢冷升压泵', '电动机保护', 'WBZ196-2', '奥祥电力自动化', '2015/12/3', '',''],
['动力车间', '1、2号机380V段', '汽机1号控制中心', '电动机保护', 'WBZ196-2', '奥祥电力自动化', '2015/12/3', '',''],
['动力车间', '1、2号机380V段', '3号工业水泵（8号）', '电动机保护', 'WBZ196-3', '奥祥电力自动化', '2015/12/3', '',''],
['动力车间', '1、2号机380V段', '1号工业水泵（8号）', '电动机保护', 'WBZ196-3', '奥祥电力自动化', '2015/12/3', '',''],
['动力车间', '1、2号机380V段', '2号工业水泵（8号）', '电动机保护', 'WBZ196-1', '奥祥电力自动化', '2015/12/3', '',''],
			];

    	for (var i = 0; i < data[0].length; i++) {
    		prop.push(String.fromCharCode(0x60 + i + 1).repeat(4));
       	}
       	for (var i = 0; i < data.length; i++) {
       		unit[prop[0]] = i+1;
       		for (var j = 1; j < prop.length; j++) {
       			unit[prop[j]] = data[i][j-1];
       		}
       		arr.push(JSON.parse(JSON.stringify(unit)));
       	}
        return arr;
    }

    ret.getTransferData = function (cnt) {
      var arr = [];
      var unit = {};
      var prop = ['Id'];
      var data = [
['动力车间', '1、2号机380V段', '1#给煤控制中心', '变压器保护', 'WBZ196-2', '奥祥电力自动化', '2015/12/3', '', ''],
['动力车间', '1、2号机380V段', '1#射水泵（7号）', '变压器保护', 'WBZ196-3', '奥祥电力自动化', '2015/12/3', '', ''],
['动力车间', '1、2号机380V段', '1号工业水泵（8号）', '电动机保护', 'WBZ196-1', '奥祥电力自动化', '2015/12/3', '', ''],
['动力车间', '1、2号机380V段', '热水循环泵', '电动机保护', 'WBZ196-2', '奥祥电力自动化', '2015/12/3', '', ''],
['动力车间', '1、2号机380V段', '1#氢冷升压泵', '电动机保护', 'WBZ196-2', '奥祥电力自动化', '2015/12/3', '', ''],
['动力车间', '1、2号机380V段', '汽机1号控制中心', '电动机保护', 'WBZ196-2', '奥祥电力自动化', '2015/12/3', '', ''],
['动力车间', '1、2号机380V段', '3号工业水泵（8号）', '电动机保护', 'WBZ196-3', '奥祥电力自动化', '2015/12/3', '', ''],
['动力车间', '1、2号机380V段', '1号工业水泵（8号）', '电动机保护', 'WBZ196-3', '奥祥电力自动化', '2015/12/3', '', ''],
['动力车间', '1、2号机380V段', '2号工业水泵（8号）', '电动机保护', 'WBZ196-1', '奥祥电力自动化', '2015/12/3', '', ''],
          ];

      var tmpData = [];
      for (var i = 0; i < data.length; i++) {
        tmpData[i] = data[(i+cnt)%data.length];
        tmpData[i][0] = i+1;
      }



      for (var i = 0; i < tmpData[0].length; i++) {
        prop.push(String.fromCharCode(0x60 + i + 1).repeat(4));
        }
        for (var i = 0; i < tmpData.length; i++) {
          unit[prop[0]] = i+1;
          for (var j = 1; j < prop.length; j++) {
            unit[prop[j]] = tmpData[i][j-1];
          }
          arr.push(JSON.parse(JSON.stringify(unit)));
        }
        return arr;
    }


    return ret;

})



















