


define(function (require) {

    var ret = {};

    String.prototype.repeat = function (n) {
        var _this = this;
        var result = '';
        for (var i = 0; i < n; i++) {
            result += _this;
        }
        return result;
    }

    //
    ret.getGrid1Data = function () {

        return [
            { Id: 1, aaaa: '0', bbbb: '最小值', cccc: '23', dddd: '26', eeee: '23', ffff: '0', gggg: '0', hhhh: '0', iiii:'0', jjjj:'1.12', kkkk:'3', llll:'22', mmmm:'8', nnnn:'' },
            { Id: 2, aaaa: '1', bbbb: '最大值', cccc: '28', dddd: '31', eeee: '26', ffff: '2', gggg: '1.5', hhhh: '0.5', iiii:'4', jjjj:'1.15', kkkk:'6', llll:'26', mmmm:'10', nnnn:'' },
      	]

    }


    ret.getGrid2Data = function () {

        return [
            { Id: 1, aaaa: '5114', bbbb: 'OT矿KC170516002', cccc: '21.58', dddd: '40.12', eeee: '30.01', ffff: '4.34', gggg: '0.34', hhhh: '0.3', iiii:'0.05', jjjj:'0.24', kkkk:'0.38', llll:'0.01', mmmm:'0.01', nnnn:'4.79', oooo:'33.94', pppp:'1.69',qqqq:'8.78',rrrr:'1.86',ssss:'' },
            { Id: 2, aaaa: '7539', bbbb: '安特米娜KC170525001', cccc: '30.58', dddd: '31.78', eeee: '24.67', ffff: '3.04', gggg: '0.3', hhhh: '1.81', iiii:'0.4', jjjj:'4.42', kkkk:'0.18', llll:'0.02', mmmm:'0.2', nnnn:'1.43', oooo:'463.72', pppp:'0.56',qqqq:'9.2',rrrr:'1.04',ssss:'' },
            { Id: 3, aaaa: '1844', bbbb: '富开姆KC170522005', cccc: '23.61', dddd: '34.27', eeee: '28.7', ffff: '7.52', gggg: '0.24', hhhh: '0.63', iiii:'0.24', jjjj:'1.26', kkkk:'0.17', llll:'0.01', mmmm:'0.01', nnnn:'5.7', oooo:'49.8', pppp:'1.56',qqqq:'7.5',rrrr:'1.45',ssss:'' },
            { Id: 4, aaaa: '3474', bbbb: '毛塔矿KC170605011', cccc: '20.92', dddd: '30.42', eeee: '36.35', ffff: '1', gggg: '1.04', hhhh: '0.33', iiii:'0.01', jjjj:'0.01', kkkk:'0.38', llll:'0.03', mmmm:'0.02', nnnn:'11', oooo:'22.6', pppp:'0.14',qqqq:'8',rrrr:'1.45',ssss:'' },
            { Id: 5, aaaa: '3159', bbbb: '西拉格达KC170509001', cccc: '20.8', dddd: '32.54', eeee: '25.47', ffff: '8.74', gggg: '0.44', hhhh: '0.61', iiii:'0.05', jjjj:'0.61', kkkk:'0.01', llll:'0.01', mmmm:'0.01', nnnn:'3.06', oooo:'60.64', pppp:'2.6',qqqq:'8.2',rrrr:'1.56',ssss:'' },
            { Id: 6, aaaa: '3474', bbbb: '伊朗国家铜业KC170623001', cccc: '22.6', dddd: '38.26', eeee: '30.2', ffff: '2.72', gggg: '0.1', hhhh: '0.2', iiii:'0.1', jjjj:'0.22', kkkk:'0.25', llll:'0.08', mmmm:'0.01', nnnn:'0.93', oooo:'28.29', pppp:'1',qqqq:'7.71',rrrr:'1.69',ssss:'' },
            { Id: 7, aaaa: '1957', bbbb: '氧化矿', cccc: '20.98', dddd: '15.32', eeee: '21.7', ffff: '17.67', gggg: '1.05', hhhh: '1.96', iiii:'1.23', jjjj:'0.98', kkkk:'0.14', llll:'0.02', mmmm:'0.01', nnnn:'3.8', oooo:'346', pppp:'4.42',qqqq:'11',rrrr:'0.73',ssss:'' },
            { Id: 8, aaaa: '100000', bbbb: '渣精矿', cccc: '23.5', dddd: '10.7', eeee: '28.16', ffff: '15.02', gggg: '0.38', hhhh: '0.8', iiii:'1.86', jjjj:'0.56', kkkk:'0.7', llll:'0.18', mmmm:'0.08', nnnn:'2', oooo:'2', pppp:'2.17',qqqq:'8.5',rrrr:'0.46',ssss:'' },
            { Id: 9, aaaa: '20169', bbbb: '金山矿', cccc: '24', dddd: '41.37', eeee: '28.05', ffff: '4.06', gggg: '0.01', hhhh: '0.06', iiii:'0.23', jjjj:'0.32', kkkk:'1.15', llll:'0.02', mmmm:'0.05', nnnn:'7.61', oooo:'154.63', pppp:'0.89',qqqq:'7.6',rrrr:'1.72',ssss:'' },
            

        ]

    }

    ret.getGrid3Data = function () {
    	var arr = [];
    	var unit = {};
    	var prop = ['Id'];
    	var data = ['1','3480','1.4','混合矿','100','24.16','29.95','26.61','7.57','0.59','0.95','0.5','1.87','0.44','0.03','0.07','3.97','224.15','1.54','8.2','1.24'];

    	for (var i = 0; i < data.length; i++) {
    		prop.push(String.fromCharCode(0x60 + i + 1).repeat(4));
       	}
       	unit[prop[0]] = 1;
       	for (var i = 1; i < prop.length; i++) {
       		unit[prop[i]] = data[i-1];
       	}
       	arr.push(unit);

        return arr;

    }

    ret.getGrid4Data = function () {
    	var arr = [];
    	var unit = {};
    	var prop = ['Id'];
    	var data = [
						['1','5114','0','OT矿KC170516002','100','3','21.58','40.12','30.01','4.34','0.34','0.3','0.05','0.24','0.38','0.01','0.01','4.79','33.94','1.69','8.78','1.86','49','104.4' ],
						['2','7539','0','安特米娜KC170525001','100','26','30.58','31.78','24.67','3.04','0.3','1.81','0.4','4.42','0.18','0.02','0.2','1.43','463.72','0.56','9.2','1.04','8.3','904.8' ],
						['3','1000','0','富开姆KC170516003','100','10','23.61','34.27','28.7','7.52','0.24','0.63','0.24','1.26','0.17','0.01','0.01','5.7','49.8','1.56','7.5','1.45','2.9','348' ],
						['4','1000','0','马来西亚混矿KC170525004','100','20','19.8','19.3','26.5','13.34','1.59','0.92','0.88','1.98','0.44','0.04','0.03','2.26','190.36','2.14','6.82','0.97','1.4','696' ],
						['5','3474','0','毛塔矿KC170605011','100','3','20.92','30.42','36.35','1','1.04','0.33','0.01','0.01','0.38','0.03','0.02','11','22.6','0.14','8','1.45','33.3','104.4' ],
						['6','3159','0','西拉格达KC170509001','100','8','20.8','32.54','25.47','8.74','0.44','0.61','0.05','0.61','0.01','0.01','0.01','3.06','60.64','2.6','8.2','1.56','11.3','278.4' ],
						['7','1957','0','氧化矿','100','7','20.98','15.32','21.7','17.67','1.05','1.96','1.23','0.98','0.14','0.02','0.01','3.8','346','4.42','11','0.73','8','243.6' ],
						['8','100000','0','渣精矿','100','3','23.5','10.7','28.16','15.02','0.38','0.8','1.86','0.56','0.7','0.18','0.08','2','2','2.17','8.5','0.46','957.9','104.4' ],
						['9','20169','0','金山矿','100','20','24','41.37','28.05','4.06','0.01','0.06','0.23','0.32','1.15','0.02','0.05','7.61','154.63','0.89','7.6','1.72','29','696' ],
					];

    	for (var i = 0; i < data[0].length; i++) {
    		prop.push(String.fromCharCode(0x60 + i + 1).repeat(4));
       	}
       	for (var i = 0; i < data.length; i++) {
       		unit[prop[0]] = i+1;
       		for (var j = 1; j < prop.length; j++) {
       			unit[prop[j]] = data[i][j-1];
       		}
       		arr.push(JSON.parse(JSON.stringify(unit)));
       	}
        return arr;
    }

    return ret;

})



















