define(function (require) {
    var ret = {};

    //
    ret.getGridData = function () {
        return [
            { ID: 1, aa: '投产', bb: '14-0698', cc: '正常', dd: '南京派飞', ee: '华东', ff: '2014/10/27', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '投产', bb: '14-0698', cc: '正常', dd: '南京派飞', ee: '华东', ff: '2014/10/27', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 3, aa: '投产', bb: '14-0698', cc: '正常', dd: '南京派飞', ee: '华东', ff: '2014/10/27', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 4, aa: '投产', bb: '14-0698', cc: '正常', dd: '南京派飞', ee: '华东', ff: '2014/10/27', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 5, aa: '投产', bb: '14-0698', cc: '正常', dd: '南京派飞', ee: '华东', ff: '2014/10/27', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 6, aa: '投产', bb: '14-0698', cc: '正常', dd: '南京派飞', ee: '华东', ff: '2014/10/27', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' },
            { ID: '', aa: '', bb: '', cc: '', dd: '', ee: '', ff: '', gg: '', hh: '', ii: '', jj: '', kk: '', ll: '' }
        ]
    }

    ret.reGetGridData = function () {
        return [
            { ID: 1, aa: '投产', bb: '14-0698', cc: '正常', dd: '南京派飞', ee: '华东', ff: '2014/10/27', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' },
            { ID: 2, aa: '投产', bb: '14-0698', cc: '正常', dd: '南京派飞', ee: '华东', ff: '2014/10/27', gg: '生效', hh: '2014JK0859', ii: '加工合同', jj: '7000', kk: '6000', ll: '' }
        ]
    }

    return ret;
})